# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/services'

# Languages
brew 'ruby'
brew 'python'
brew 'python3'
brew 'go'

# Core Utilities
brew 'mas'

brew 'ag'
brew 'cloc'
brew 'coreutils'
brew 'fd'
brew 'fish'
brew 'htop'
brew 'hugo'
brew 'nmap'
brew 'pigz'
brew 'reattach-to-user-namespace'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'xz'

# Dev Tools
brew 'carthage'
brew 'git'
brew 'node'
brew 'vim'

# Security
brew 'gnupg'
brew 'gnupg2'
brew 'pinentry-mac'

# Other Tools
brew 'aspell'
brew 'ffmpeg', args: ['with-x265']
brew 'ledger'
brew 'pandoc'
brew 'syncthing'
brew 'youtube-dl'

# Python Libraries
brew 'numpy', args: ['with-python3']
brew 'scipy', args: ['with-python3']

# macOS Software
cask 'anki'
cask 'appcleaner'
cask 'arq'
cask 'calibre'
cask 'daisydisk'
cask 'dash'
cask 'db-browser-for-sqlite'
cask 'dropbox'
cask 'emacs'
cask 'firefox'
cask 'handbrake'
cask 'hex-fiend'
cask 'iina'
cask 'istat-menus'
cask 'keka'
cask 'provisionql'
cask 'qlstephen'
cask 'sketch'
cask 'smcfancontrol'
cask 'spectacle'
cask 'spotify'
cask 'subler'
cask 'superduper'
cask 'transmission'
cask 'transmit'
cask 'viscosity'

mas '1Blocker', id: 1107421413
mas '1Password 7', id: 1333542190
mas 'Amphetamine', id: 937984704
mas 'Deliveries', id: 924726344
mas 'Marked', id: 890031187
mas 'PDF Expert', id: 1055273043
mas 'Slack', id: 803453959
mas 'Things 3', id: 904280696

# Fonts
cask 'font-cabin'
cask 'font-iosevka'
cask 'font-lato'
cask 'font-source-sans-pro'
