tap "beeftornado/rmtree"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"

brew "asdf"
brew "bundletool"
brew "dust"
brew "lorem"
brew "swiftlint"

cask "appcleaner"
cask "calibre"
cask "dash"
cask "discord"
cask "hex-fiend"
cask "iina"
cask "imageoptim"
cask "kitty"
cask "mailmate"
cask "microsoft-teams"
cask "paw"
cask "proxyman"
cask "red-eye"
cask "reveal"
cask "spectacle"
cask "spotify"
cask "superduper"
cask "transmit"
